<a href="https://colab.research.google.com/github/santhoshBjeeffy/Pandas/blob/master/Merge_part2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Fictitious Names

Introduction:

This time you will create a data again

Special thanks to Chris Albon for sharing the dataset and materials. All the credits to this exercise belongs to him.

In order to understand about it go to here.

In [0]:
import pandas as pd

In [0]:
raw_data1={
    'subject_id':['1','2','3','4'],
    'first_name':['Manoj','santhosh','shivakumar','chethan'],
    'last_name':['sachin','jeffy','khan','gowda'] }


raw_data2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

In [0]:
data1=pd.DataFrame(raw_data1, columns=['subject_id','first_name','last_name'])
data2=pd.DataFrame(raw_data2, columns=['subject_id','first_name','last_name'])
data3=pd.DataFrame(raw_data3,columns=['subject_id','test_id'])

In [8]:
data3

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

# Join the two dataframes along rows and assign all_data

In [9]:
all_data=pd.concat([data1,data2])
all_data

  subject_id  first_name last_name
0          1       Manoj    sachin
1          2    santhosh     jeffy
2          3  shivakumar      khan
3          4     chethan     gowda
0          4       Billy    Bonder
1          5       Brian     Black
2          6        Bran   Balwner
3          7       Bryce     Brice
4          8       Betty    Btisan

# Join the two dataframes along columns and assing to all_data_col

In [10]:
all_data_col=pd.concat([data1,data2],axis=1)
all_data_col

  subject_id  first_name last_name subject_id first_name last_name
0          1       Manoj    sachin          4      Billy    Bonder
1          2    santhosh     jeffy          5      Brian     Black
2          3  shivakumar      khan          6       Bran   Balwner
3          4     chethan     gowda          7      Bryce     Brice
4        NaN         NaN       NaN          8      Betty    Btisan

In [11]:
all_data_col.dropna()

  subject_id  first_name last_name subject_id first_name last_name
0          1       Manoj    sachin          4      Billy    Bonder
1          2    santhosh     jeffy          5      Brian     Black
2          3  shivakumar      khan          6       Bran   Balwner
3          4     chethan     gowda          7      Bryce     Brice

# Merge all_data and data3 along the subject_id value

In [12]:
pd.merge(all_data,data3,on='subject_id')

  subject_id  first_name last_name  test_id
0          1       Manoj    sachin       51
1          2    santhosh     jeffy       15
2          3  shivakumar      khan       15
3          4     chethan     gowda       61
4          4       Billy    Bonder       61
5          5       Brian     Black       16
6          7       Bryce     Brice       14
7          8       Betty    Btisan       15

#Merge only the data that has the same 'subject_id' on both data1 and data2

In [14]:
pd.merge(data1,data2,on='subject_id',how='inner')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4      chethan       gowda        Billy      Bonder

Merge all values in data1 and data2, with matching records from both sides where available

In [15]:
pd.merge(data1, data2, on='subject_id', how='outer')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1        Manoj      sachin          NaN         NaN
1          2     santhosh       jeffy          NaN         NaN
2          3   shivakumar        khan          NaN         NaN
3          4      chethan       gowda        Billy      Bonder
4          5          NaN         NaN        Brian       Black
5          6          NaN         NaN         Bran     Balwner
6          7          NaN         NaN        Bryce       Brice
7          8          NaN         NaN        Betty      Btisan